Tekla Open API Reference for Tekla Structures 2025
Projection.PointToLine Method
 Returns a new point which is a projection of the given point onto the given line.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Point PointToLine(
	Point Point,
	Line Line
)
Public Shared Function PointToLine (
	Point As Point,
	Line As Line
) As Point
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point to be used.
Line
Type: Tekla.Structures.Geometry3d.Line
The line to be used.
Return Value
Type: Point
The new projection point.
See Also
Reference
Projection Class
Tekla.Structures.Geometry3d Namespace